onegbps/files/zte/FTTH_INT_USRADD.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.zte.com.cn/accessnetwork/ems/webservice/">
   <soapenv:Header>
      <web:Authentication>
         <userName>slt</userName>
         <password>Slt@17XML</password>
      </web:Authentication>
   </soapenv:Header>
   <soapenv:Body>
      <web:OperationRequestInfo>
         <operationName>CHG-ONUWANIP</operationName>
         <!--Optional:-->
         <operatedObject>
            <!--Zero or more repetitions:-->
            <param>
               <name>DNAME</name>
               <value>ADSL_ZTE_DNAME</value>
            </param>
                <param>
               <name>OID</name>
               <value>FTTH_ZTE_PID-FTTH_HUW_VP</value>
            </param>
         </operatedObject>
         <operationParam>
            <!--Zero or more repetitions:-->
          <param>
               <name>IPHOSTID</name>
               <value>1</value>
           </param>
	<param>
               <name>PPPOEUSER</name>
               <value>ADSL_ZTE_USERNAME@sltbb</value>
           </param>
	<param>
               <name>PPPOEPWD</name>
               <value>test123</value>
           </param>
	<param>
               <name>VID</name>
               <value>20</value>
           </param>
	         </operationParam>
      </web:OperationRequestInfo>
   </soapenv:Body>
</soapenv:Envelope>
